app/controllers/admin/access_controller.rb

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
INSERT INTO "preferences" ("allow_create_songs", "allow_create_artists", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["allow_create_songs", "t"], ["allow_create_artists", "t"], ["created_at", "2016-03-31 05:44:35.767970"], ["updated_at", "2016-03-31 05:44:35.767970"]]
---
  def index
    if Preference.first.present?
      @preference = Preference.first
    else
      @preference = Preference.create

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
UPDATE "preferences" SET "allow_create_songs" = ?, "allow_create_artists" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["allow_create_songs", "f"], ["allow_create_artists", "t"], ["updated_at", "2016-02-02 00:17:49.602109"], ["id", 1]]
---
  def update
    @preference = Preference.first
    if @preference.update(access_params)